# --- Applications ---
cask 'visual-studio-code'
cask 'brave-browser'
cask 'raycast'
cask 'alt-tab'
cask 'rectangle'
cask 'oversight'
cask 'spotify'
cask 'cryptomator'
cask 'google-drive'
cask 'sublime-text'
cask 'cursor'
cask 'alacritty'
cask 'jordanbaird-ice'

# --- CLI Tools ---
brew 'tree'
brew 'lf'
brew 'speedtest-cli'
brew 'zip'
brew 'wget'
brew 'tmux'
brew 'direnv'
cask 'fuse-t'
brew 'starship'
brew 'stow'
brew 'zsh-syntax-highlighting'
brew 'mas'

# --- Fonts ---
cask 'font-fira-code-nerd-font'

# --- Mac App Store Apps ---
mas 'Bitwarden', id: 1352778147
mas 'Tailscale', id: 1470499037
mas 'Amphetamine', id: 937984704 

